---
title: ArrayFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ArrayFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ArrayFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ArrayingNotSupportedForElements { get; }` | `ArrayFailures.ArrayingNotSupportedForElements` | FailureDefinitionId |
| `FailureDefinitionId ArrayMixedModAndViewSpecElemsCorruption { get; }` | `ArrayFailures.ArrayMixedModAndViewSpecElemsCorruption` | FailureDefinitionId |
| `FailureDefinitionId ArrayMixedModAndViewSpecElemsWarning { get; }` | `ArrayFailures.ArrayMixedModAndViewSpecElemsWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateArraySelectionIsGrouped { get; }` | `ArrayFailures.CannotCreateArraySelectionIsGrouped` | FailureDefinitionId |
| `FailureDefinitionId ConstraintsNotSatisfied { get; }` | `ArrayFailures.ConstraintsNotSatisfied` | FailureDefinitionId |
| `FailureDefinitionId CouldntFindNewHostsForElements { get; }` | `ArrayFailures.CouldntFindNewHostsForElements` | FailureDefinitionId |
| `FailureDefinitionId IdenticalGeometryCopiesInArray { get; }` | `ArrayFailures.IdenticalGeometryCopiesInArray` | FailureDefinitionId |
| `FailureDefinitionId RadiusTooSmall { get; }` | `ArrayFailures.RadiusTooSmall` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```